In [ ]:
#Lab Assignment-3
#Descriptive Statistics - Measures of Central Tendency and variability
#Perform the following operations on any open source dataset (e.g., data.csv)
#1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for
#a dataset (age, income etc.) with numeric variables grouped by one of the qualitative
#(categorical) variable. For example, if your categorical variable is age groups and
#quantitative variable is income, then provide summary statistics of income grouped by the
#age groups. Create a list that contains a numeric value for each response to the categorical
#variable.

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import statistics as st

In [6]:
df = pd.read_csv("C:\\Users\\rhuta\Downloads\\loan.csv - loan.csv.csv")
df

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Total_Income
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,"$5,849.00"
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,"$6,091.00"
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,"$3,000.00"
3,3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,"$4,941.00"
4,4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,"$6,000.00"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,495,LP002586,Female,Yes,1,Graduate,No,3326,913.0,105.0,84.0,1.0,Semiurban,Y,"$4,239.00"
496,496,LP002587,Male,Yes,0,Not Graduate,No,2600,1700.0,107.0,360.0,1.0,Rural,Y,"$4,300.00"
497,497,LP002588,Male,Yes,0,Graduate,No,4625,2857.0,111.0,12.0,NaN,Urban,Y,"$7,482.00"
498,498,LP002600,Male,Yes,1,Graduate,Yes,2895,0.0,95.0,360.0,1.0,Semiurban,Y,"$2,895.00"
499,499,LP002602,Male,No,0,Graduate,No,6283,4416.0,209.0,360.0,0.0,Rural,N,"$10,699.00"

In [7]:
print(df.shape)

(500, 15)

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         500 non-null    int64
 1   Loan_ID            500 non-null    object
 2   Gender             491 non-null    object
 3   Married            497 non-null    object
 4   Dependents         488 non-null    object
 5   Education          500 non-null    object
 6   Self_Employed      473 non-null    object
 7   ApplicantIncome    500 non-null    int64
 8   CoapplicantIncome  500 non-null    float64
 9   LoanAmount         482 non-null    float64
 10  Loan_Amount_Term   486 non-null    float64
 11  Credit_History     459 non-null    float64
 12  Property_Area      500 non-null    object
 13  Loan_Status        500 non-null    object
 14  Total_Income       500 non-null    object
dtypes: float64(4), int64(2), object(9)
memory usage: 58.7+ KB
None

In [9]:
df.mean()

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Unnamed: 0            249.500000
ApplicantIncome      5493.644000
CoapplicantIncome    1506.307840
LoanAmount            144.020747
Loan_Amount_Term      342.543210
Credit_History          0.843137
dtype: float64

In [10]:
df.max()

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\1151452817.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

Unnamed: 0                    499
Loan_ID                  LP002602
Education            Not Graduate
ApplicantIncome             81000
CoapplicantIncome         20000.0
LoanAmount                  700.0
Loan_Amount_Term            480.0
Credit_History                1.0
Property_Area               Urban
Loan_Status                     Y
Total_Income            $9,993.00
dtype: object

In [11]:
df.min()

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\3962516015.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min()

Unnamed: 0                   0
Loan_ID               LP001002
Education             Graduate
ApplicantIncome            150
CoapplicantIncome          0.0
LoanAmount                17.0
Loan_Amount_Term          12.0
Credit_History             0.0
Property_Area            Rural
Loan_Status                  N
Total_Income         $1,442.00
dtype: object

In [12]:
df.median

<bound method NDFrame._add_numeric_operations.<locals>.median of      Unnamed: 0   Loan_ID  Gender Married Dependents     Education  \
0             0  LP001002    Male      No          0      Graduate
1             1  LP001003    Male     Yes          1      Graduate
2             2  LP001005    Male     Yes          0      Graduate
3             3  LP001006    Male     Yes          0  Not Graduate
4             4  LP001008    Male      No          0      Graduate
..          ...       ...     ...     ...        ...           ...
495         495  LP002586  Female     Yes          1      Graduate
496         496  LP002587    Male     Yes          0  Not Graduate
497         497  LP002588    Male     Yes          0      Graduate
498         498  LP002600    Male     Yes          1      Graduate
499         499  LP002602    Male      No          0      Graduate

    Self_Employed  ApplicantIncome  CoapplicantIncome  LoanAmount  \
0              No             5849                0.0         NaN
1              No             4583             1508.0       128.0
2             Yes             3000                0.0        66.0
3              No             2583             2358.0       120.0
4              No             6000                0.0       141.0
..            ...              ...                ...         ...
495            No             3326              913.0       105.0
496            No             2600             1700.0       107.0
497            No             4625             2857.0       111.0
498           Yes             2895                0.0        95.0
499            No             6283             4416.0       209.0

     Loan_Amount_Term  Credit_History Property_Area Loan_Status Total_Income
0               360.0             1.0         Urban           Y    $5,849.00
1               360.0             1.0         Rural           N    $6,091.00
2               360.0             1.0         Urban           Y    $3,000.00
3               360.0             1.0         Urban           Y    $4,941.00
4               360.0             1.0         Urban           Y    $6,000.00
..                ...             ...           ...         ...          ...
495              84.0             1.0     Semiurban           Y    $4,239.00
496             360.0             1.0         Rural           Y    $4,300.00
497              12.0             NaN         Urban           Y    $7,482.00
498             360.0             1.0     Semiurban           Y    $2,895.00
499             360.0             0.0         Rural           N   $10,699.00

[500 rows x 15 columns]>

In [13]:
df.std()

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Unnamed: 0            144.481833
ApplicantIncome      6515.668972
CoapplicantIncome    2134.432188
LoanAmount             82.344919
Loan_Amount_Term       63.834977
Credit_History          0.364068
dtype: float64

In [15]:
print(df.loc[:,'LoanAmount'].mean())

144.0207468879668

In [16]:
df.mean(axis = 1)[0:5]

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\369270116.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis = 1)[0:5]

0    1242.000000
1    1096.833333
2     571.500000
3     904.166667
4    1084.333333
dtype: float64

In [18]:
print(df.loc[:,'LoanAmount'].median())

126.5

In [19]:
df.median(axis = 1)[0:5]

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\1941941222.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median(axis = 1)[0:5]

0      1.0
1    244.0
2     34.0
3    240.0
4     72.5
dtype: float64

In [20]:
df.var()

C:\Users\rhuta\AppData\Local\Temp\ipykernel_2116\1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

Unnamed: 0           2.087500e+04
ApplicantIncome      4.245394e+07
CoapplicantIncome    4.555801e+06
LoanAmount           6.780686e+03
Loan_Amount_Term     4.074904e+03
Credit_History       1.325456e-01
dtype: float64

In [21]:
df[["Gender","LoanAmount"]].groupby("Gender").mean()

        LoanAmount
Gender
Female  121.068182
Male    147.197403

In [22]:
df[["Gender","LoanAmount"]].groupby("Gender").median()

        LoanAmount
Gender
Female       115.5
Male         128.0

In [23]:
df[["Self_Employed","LoanAmount"]].groupby("Self_Employed").mean()

               LoanAmount
Self_Employed
No             141.836735
Yes            155.312500